SM_для_EDT/src/InformationRegisters/рарусСоответствиеПользователяФизическомуЛицу/рарусСоответствиеПользователяФизическомуЛицу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусСоответствиеПользователяФизическомуЛицу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заведование</name>
    <type>
      <types>CatalogRef.впКвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/рарусСоответствиеПользователяФизическомуЛицу/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ФизическоеЛицоПользователя(Пользователь, Период = Неопределено) Экспорт
	
	Если Период = Неопределено ИЛИ Период = Дата("00010101") Тогда
		Период = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рарусСоответствиеПользователяФизическомуЛицуСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	рарусСоответствиеПользователяФизическомуЛицуСрезПоследних.Заведование КАК Заведование
		|ИЗ
		|	РегистрСведений.рарусСоответствиеПользователяФизическомуЛицу.СрезПоследних(&Период, Пользователь = &Пользователь) КАК рарусСоответствиеПользователяФизическомуЛицуСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Новый Структура("ФизЛицо, Заведование", ВыборкаДетальныеЗаписи.ФизическоеЛицо, ВыборкаДетальныеЗаписи.Заведование)
	Иначе
		Возврат Неопределено
	КонецЕсли;

КонецФункции

Процедура СохранитьФизическоеЛицоПользователя (Пользователь, ФизическоеЛицо, Заведование, Период = Неопределено) Экспорт
	
	ДанныеФЛДляПроверки = ФизическоеЛицоПользователя(Пользователь, Период);
	Если ДанныеФЛДляПроверки <> Неопределено 
		И ДанныеФЛДляПроверки.ФизЛицо = ФизическоеЛицо И ДанныеФЛДляПроверки.Заведование = Заведование // Физлицо не изменилось, выходим
		ИЛИ ФизическоеЛицо = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда // Физлицо не заполнено, выходим
		Возврат
	Иначе
		Если Период = Неопределено ИЛИ Период = Дата("00010101") Тогда
			Период = НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.рарусСоответствиеПользователяФизическомуЛицу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Период);
		Если Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
			НаборЗаписей.Отбор.Заведование.Установить(Заведование);
		Иначе
			НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Период;
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.Заведование = Заведование;
		НоваяЗапись.ФизическоеЛицо = ФизическоеЛицо;
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
